In [1]:
import pandas as pd
import geopandas as gpd
import matplotlib.pyplot as plt

d:\workspace\python38\lib\site-packages\geopandas\_compat.py:123: UserWarning: The Shapely GEOS version (3.10.3-CAPI-1.16.1) is incompatible with the GEOS version PyGEOS was compiled with (3.10.4-CAPI-1.16.2). Conversions between both will be slow.
  warnings.warn(

In [2]:
df=gpd.read_file(r"D:\GaoYunshu2023\100011 HK-Work\RA-project\001 Task description\Task1\Process\twitterPoint_final.shp")

In [3]:
df1=df[['OBJECTID_1','Field1','created_at','id_str','lang','time_zone','LanduseTyp','geometry']]
df2=pd.read_csv(r"D:\GaoYunshu2023\100011 HK-Work\RA-project\001 Task description\Task1\result_v2.csv")

C:\Users\GAOYUN~1\AppData\Local\Temp/ipykernel_15256/4248614074.py:2: DtypeWarning: Columns (7) have mixed types. Specify dtype option on import or set low_memory=False.
  df2=pd.read_csv(r"D:\GaoYunshu2023\100011 HK-Work\RA-project\001 Task description\Task1\result_v2.csv")

In [4]:
df2.rename(columns={df2.columns[0]: "Field1" }, inplace = True)
df3 = pd.merge(df1, df2, on='Field1', how='inner')

In [5]:
df3['date_hk'] = pd.to_datetime(df3['date_hk'])
df3['NEWdate_hk'] = pd.to_datetime(df3['date_hk']).dt.strftime('%Y-%m-%d-%H-%M')
df3['day'] = df3['date_hk'].dt.day
df3['month'] = df3['date_hk'].dt.month
df3['year'] = df3['date_hk'].dt.year
df3['hour']=df3['date_hk'].dt.hour
df3['minute']=df3['date_hk'].dt.minute

In [6]:
df3.head(5)

,OBJECTID_1,Field1,created_at_x,id_str_x,lang_x,time_zone_x,LanduseTyp,geometry,created_at_y,id_str_y,...,date,date_secondprocess,date_thirdprocess,date_hk,NEWdate_hk,day,month,year,hour,minute
0,1,1246,Sun May 08 19:42:57 +0000 2016,7.290000e+17,en,Abu Dhabi,8,POINT (114.17800 22.28090),Sun May 08 19:42:57 +0000 2016,7.290000e+17,...,2016-05-08 19:42:57+00:00,5/8/2016 19:42,5/8/2016 19:42,2016-05-08 23:42:00,2016-05-08-23-42,8,5,2016,23,42
1,2,1254,Sun May 08 21:20:20 +0000 2016,7.290000e+17,en,Abu Dhabi,999,POINT (113.93337 22.31488),Sun May 08 21:20:20 +0000 2016,7.290000e+17,...,2016-05-08 21:20:20+00:00,5/8/2016 21:20,5/8/2016 21:20,2016-05-09 01:20:00,2016-05-09-01-20,9,5,2016,1,20
2,3,3007,Thu May 12 08:04:44 +0000 2016,7.310000e+17,en,Abu Dhabi,8,POINT (114.17800 22.28090),Thu May 12 08:04:44 +0000 2016,7.310000e+17,...,2016-05-12 08:04:44+00:00,5/12/2016 8:04,5/12/2016 8:04,2016-05-12 12:04:00,2016-05-12-12-04,12,5,2016,12,4
3,4,3715,Fri May 13 09:07:09 +0000 2016,7.310000e+17,en,Abu Dhabi,7,POINT (114.20402 22.33934),Fri May 13 09:07:09 +0000 2016,7.310000e+17,...,2016-05-13 09:07:09+00:00,5/13/2016 9:07,5/13/2016 9:07,2016-05-13 13:07:00,2016-05-13-13-07,13,5,2016,13,7
4,5,4297,Sat May 14 06:37:43 +0000 2016,7.310000e+17,en,Abu Dhabi,3,POINT (114.04353 22.31342),Sat May 14 06:37:43 +0000 2016,7.310000e+17,...,2016-05-14 06:37:43+00:00,5/14/2016 6:37,5/14/2016 6:37,2016-05-14 10:37:00,2016-05-14-10-37,14,5,2016,10,37

In [7]:
df4=df3[['OBJECTID_1','Field1','LanduseTyp','year','month','day','hour','minute','NEWdate_hk','geometry']]

In [8]:
df4.head(5)

,OBJECTID_1,Field1,LanduseTyp,year,month,day,hour,minute,NEWdate_hk,geometry
0,1,1246,8,2016,5,8,23,42,2016-05-08-23-42,POINT (114.17800 22.28090)
1,2,1254,999,2016,5,9,1,20,2016-05-09-01-20,POINT (113.93337 22.31488)
2,3,3007,8,2016,5,12,12,4,2016-05-12-12-04,POINT (114.17800 22.28090)
3,4,3715,7,2016,5,13,13,7,2016-05-13-13-07,POINT (114.20402 22.33934)
4,5,4297,3,2016,5,14,10,37,2016-05-14-10-37,POINT (114.04353 22.31342)

In [9]:
df5=pd.pivot_table(df4,index=['OBJECTID_1','Field1','year','month','day','hour','minute','NEWdate_hk'],columns=['LanduseTyp'],aggfunc='count').fillna(0).astype(int)

In [10]:
df5.head(5)

                                                              geometry      \
LanduseTyp                                                         1   2
OBJECTID_1 Field1 year month day hour minute NEWdate_hk
1          1246   2016 5     8   23   42     2016-05-08-23-42        0   0
2          1254   2016 5     9   1    20     2016-05-09-01-20        0   0
3          3007   2016 5     12  12   4      2016-05-12-12-04        0   0
4          3715   2016 5     13  13   7      2016-05-13-13-07        0   0
5          4297   2016 5     14  10   37     2016-05-14-10-37        0   0

                                                                               \
LanduseTyp                                                    3   4   5   6
OBJECTID_1 Field1 year month day hour minute NEWdate_hk
1          1246   2016 5     8   23   42     2016-05-08-23-42   0   0   0   0
2          1254   2016 5     9   1    20     2016-05-09-01-20   0   0   0   0
3          3007   2016 5     12  12   4      2016-05-12-12-04   0   0   0   0
4          3715   2016 5     13  13   7      2016-05-13-13-07   0   0   0   0
5          4297   2016 5     14  10   37     2016-05-14-10-37   1   0   0   0


LanduseTyp                                                    7   8   999
OBJECTID_1 Field1 year month day hour minute NEWdate_hk
1          1246   2016 5     8   23   42     2016-05-08-23-42   0   1   0
2          1254   2016 5     9   1    20     2016-05-09-01-20   0   0   1
3          3007   2016 5     12  12   4      2016-05-12-12-04   0   1   0
4          3715   2016 5     13  13   7      2016-05-13-13-07   1   0   0
5          4297   2016 5     14  10   37     2016-05-14-10-37   0   0   0

In [11]:
df6=df5.groupby(['NEWdate_hk','year','month','day','hour','minute']).sum()

In [12]:
df6.head(5)

                                            geometry                          \
LanduseTyp                                       1   2   3   4   5   6   7
NEWdate_hk       year month day hour minute
2016-05-07-03-25 2016 5     7   3    25            0   0   0   0   0   0   0
2016-05-07-06-01 2016 5     7   6    1             0   0   0   0   0   0   0
2016-05-07-06-17 2016 5     7   6    17            0   0   0   0   0   0   0
2016-05-07-06-18 2016 5     7   6    18            0   0   0   0   0   0   1
2016-05-07-07-02 2016 5     7   7    2             0   0   0   0   0   0   0


LanduseTyp                                  8   999
NEWdate_hk       year month day hour minute
2016-05-07-03-25 2016 5     7   3    25       0   1
2016-05-07-06-01 2016 5     7   6    1        1   0
2016-05-07-06-17 2016 5     7   6    17       1   0
2016-05-07-06-18 2016 5     7   6    18       0   0
2016-05-07-07-02 2016 5     7   7    2        0   1

In [24]:
df3['NEWdate_hk_YMD'] = pd.to_datetime(df3['date_hk']).dt.strftime('%Y-%m-%d')
df4=df3[['OBJECTID_1','Field1','LanduseTyp','year','month','day','NEWdate_hk_YMD','geometry']]
df5=pd.pivot_table(df4,index=['OBJECTID_1','Field1','year','month','day','NEWdate_hk_YMD'],columns=['LanduseTyp'],aggfunc='count').fillna(0).astype(int)

In [25]:
df7=df5.groupby(['NEWdate_hk_YMD','year','month','day']).sum()

In [26]:
df7.head(5)

                              geometry
LanduseTyp                         1    2    3   4   5   6   7    8    999
NEWdate_hk_YMD year month day
2016-05-07     2016 5     7          3   59   77  48   2   1  52   81  142
2016-05-08     2016 5     8          2  100  103  75   4   2  57  125  279
2016-05-09     2016 5     9          0   57   96  59   2   1  44  112  170
2016-05-10     2016 5     10         0   69   70  58   1   2  44   81  139
2016-05-11     2016 5     11         0   65   63  71   1   1  50  111  145

In [27]:
df7.to_csv(r'D:\GaoYunshu2023\100011 HK-Work\RA-project\001 Task description\By Day_V1.csv')